<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 2 changes.</summary>

```diff
# module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config has been deleted
# module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has been deleted
+ module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config will be created
+ module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 2 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-13T23:08:38Z [(view log)](https://github.com/perchnet/p/actions/runs/16254425317/job/45888531349#step:9:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config has been deleted
  - resource "proxmox_virtual_environment_file" "cloud_user_config" {
      - id             = "snippets:snippets/c476a199.butane-ci-user-data.ign" -> null
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has been deleted
  - resource "proxmox_virtual_environment_vm" "coreos_vm" {
        id                      = "131"
      - name                    = "coreos-periphery-test" -> null
        tags                    = [
            "terraform",
        ]
      - vm_id                   = 131 -> null
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = "685a3d9b.butane-ci-user-data.ign"
          + resize    = 0
        }
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm will be created
  + resource "proxmox_virtual_environment_vm" "coreos_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "coreos-periphery-test"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = "zssd-files:iso/fedora-coreos-42_TFimg-0af9.20250705.2.0-proxmoxve.x86_64.qcow2.xz.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-zfs"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 2048
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-33-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->